#програма приймає текст від користувача та виводить найдовше та найкоротше слово
s = input('Введіть тут текст: ')
a = s.split(' ') #розбиваємо текст на окремі слова

max_len = 0        # в цю змінну буде записуватись кількість символів в слові максимальна
min_len = len(a)   # в цю змінну буде записуватись кількість символів в слові мінімальна
max_slovo = ''     # пустий стрінг для запису в нього максимального слова
min_slovo = ''     # пустий стрінг для запису в нього мінімального слова

for i in range(len(a)):
    if len(a[i]) > max_len:
        max_len = len(a[i])
        max_slovo = a[i]
    elif len(a[i]) < min_len:
        min_len = len(a[i])
        min_slovo = a[i]

print('Найдовше слово: ', max_slovo, max_len)
print('Найкоротше слово: ', min_slovo, min_len)
